bench/trimbench/res.ext4.nodiscard.noraid.1crucial.linux65.socket2/o.test.out
nohup: ignoring input
Create /data/m/f.1 at Wed Jun 19 02:17:08 AM UTC 2024
1048576+0 records in
1048576+0 records out
1099511627776 bytes (1.1 TB, 1.0 TiB) copied, 3691.98 s, 298 MB/s
-rw-rw-r-- 1 mdcallag mdcallag 1.0T Jun 19 03:18 /data/m/f.1
Sleep for 30 seconds after creating /data/m/f.1 at Wed Jun 19 03:18:40 AM UTC 2024
stat: cannot statx '/data/m/f.2': No such file or directory
run.sh: line 27: [: -lt: unary operator expected
Existing /data/m/f.2 is large enough
Create /data/m/f.2 then sleep for 30 seconds at Wed Jun 19 03:19:14 AM UTC 2024
32768+0 records in
32768+0 records out
34359738368 bytes (34 GB, 32 GiB) copied, 113.065 s, 304 MB/s
-rw-rw-r-- 1 mdcallag mdcallag 32G Jun 19 03:21 /data/m/f.2
List kernel
Linux socket2 6.5.0-35-generic #35~22.04.1-Ubuntu SMP PREEMPT_DYNAMIC Tue May  7 09:00:52 UTC 2 x86_64 x86_64 x86_64 GNU/Linux
List mount options for filesystems
sysfs on /sys type sysfs (rw,nosuid,nodev,noexec,relatime)
proc on /proc type proc (rw,nosuid,nodev,noexec,relatime)
udev on /dev type devtmpfs (rw,nosuid,relatime,size=32720388k,nr_inodes=8180097,mode=755,inode64)
devpts on /dev/pts type devpts (rw,nosuid,noexec,relatime,gid=5,mode=620,ptmxmode=000)
tmpfs on /run type tmpfs (rw,nosuid,nodev,noexec,relatime,size=6557228k,mode=755,inode64)
efivarfs on /sys/firmware/efi/efivars type efivarfs (rw,nosuid,nodev,noexec,relatime)
/dev/sda2 on / type ext4 (rw,relatime)
securityfs on /sys/kernel/security type securityfs (rw,nosuid,nodev,noexec,relatime)
tmpfs on /dev/shm type tmpfs (rw,nosuid,nodev,inode64)
tmpfs on /run/lock type tmpfs (rw,nosuid,nodev,noexec,relatime,size=5120k,inode64)
cgroup2 on /sys/fs/cgroup type cgroup2 (rw,nosuid,nodev,noexec,relatime,nsdelegate,memory_recursiveprot)
pstore on /sys/fs/pstore type pstore (rw,nosuid,nodev,noexec,relatime)
bpf on /sys/fs/bpf type bpf (rw,nosuid,nodev,noexec,relatime,mode=700)
systemd-1 on /proc/sys/fs/binfmt_misc type autofs (rw,relatime,fd=29,pgrp=1,timeout=0,minproto=5,maxproto=5,direct,pipe_ino=20760)
hugetlbfs on /dev/hugepages type hugetlbfs (rw,relatime,pagesize=2M)
mqueue on /dev/mqueue type mqueue (rw,nosuid,nodev,noexec,relatime)
debugfs on /sys/kernel/debug type debugfs (rw,nosuid,nodev,noexec,relatime)
tracefs on /sys/kernel/tracing type tracefs (rw,nosuid,nodev,noexec,relatime)
fusectl on /sys/fs/fuse/connections type fusectl (rw,nosuid,nodev,noexec,relatime)
configfs on /sys/kernel/config type configfs (rw,nosuid,nodev,noexec,relatime)
ramfs on /run/credentials/systemd-sysusers.service type ramfs (ro,nosuid,nodev,noexec,relatime,mode=700)
/var/lib/snapd/snaps/core20_2264.snap on /snap/core20/2264 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/core20_2318.snap on /snap/core20/2318 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/lxd_27948.snap on /snap/lxd/27948 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/lxd_28373.snap on /snap/lxd/28373 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/snapd_21759.snap on /snap/snapd/21759 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/snapd_21465.snap on /snap/snapd/21465 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/dev/sdb on /data2 type ext4 (rw,noatime,nodiratime,discard)
/dev/sda1 on /boot/efi type vfat (rw,relatime,fmask=0022,dmask=0022,codepage=437,iocharset=iso8859-1,shortname=mixed,errors=remount-ro)
binfmt_misc on /proc/sys/fs/binfmt_misc type binfmt_misc (rw,nosuid,nodev,noexec,relatime)
tmpfs on /run/snapd/ns type tmpfs (rw,nosuid,nodev,noexec,relatime,size=6557228k,mode=755,inode64)
nsfs on /run/snapd/ns/lxd.mnt type nsfs (rw)
tmpfs on /run/user/1000 type tmpfs (rw,nosuid,nodev,relatime,size=6557224k,nr_inodes=1639306,mode=700,uid=1000,gid=1000,inode64)
/dev/nvme0n1 on /data type ext4 (rw,relatime)

Remove /data/m/f.1 at Wed Jun 19 03:21:45 AM UTC 2024
Start fio to read from /data/m/f.2 at Wed Jun 19 03:21:45 AM UTC 2024

iops-test-job: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.28
Starting 1 process

iops-test-job: (groupid=0, jobs=1): err= 0: pid=1797904: Wed Jun 19 03:23:15 2024
  read: IOPS=131k, BW=511MiB/s (535MB/s)(44.9GiB/90001msec)
    slat (nsec): min=1411, max=395135, avg=2708.40, stdev=1149.30
    clat (usec): min=7, max=22358, avg=55.05, stdev=75.21
     lat (usec): min=9, max=22361, avg=57.85, stdev=75.48
    clat percentiles (usec):
     |  1.00th=[   43],  5.00th=[   44], 10.00th=[   45], 20.00th=[   47],
     | 30.00th=[   48], 40.00th=[   48], 50.00th=[   49], 60.00th=[   51],
     | 70.00th=[   52], 80.00th=[   53], 90.00th=[   57], 95.00th=[   63],
     | 99.00th=[  141], 99.50th=[  355], 99.90th=[ 1156], 99.95th=[ 1287],
     | 99.99th=[ 1516]
   bw (  KiB/s): min=43480, max=633552, per=100.00%, avg=544141.16, stdev=150774.60, samples=172
   iops        : min=10870, max=158388, avg=136035.28, stdev=37693.65, samples=172
  lat (usec)   : 10=0.01%, 20=0.01%, 50=58.05%, 100=40.70%, 250=0.54%
  lat (usec)   : 500=0.34%, 750=0.10%, 1000=0.11%
  lat (msec)   : 2=0.15%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=19.81%, sys=49.18%, ctx=3642720, majf=0, minf=30
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=11763976,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=511MiB/s (535MB/s), 511MiB/s-511MiB/s (535MB/s-535MB/s), io=44.9GiB (48.2GB), run=90001-90001msec

Disk stats (read/write):
  nvme0n1: ios=11747897/626, merge=0/16091, ticks=594939/242, in_queue=595191, util=95.67%

run.sh: line 61: kill: (1797876) - No such process